mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/projects/iar/startup_s6e2c2.s
                PUBWEAK UsageFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
                B       UsageFault_Handler

                PUBWEAK SVC_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
                B       SVC_Handler

                PUBWEAK DebugMon_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
                B       DebugMon_Handler

                PUBWEAK PendSV_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
                B       PendSV_Handler

                PUBWEAK SysTick_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
                B       SysTick_Handler

                
                PUBWEAK CSV_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
CSV_IRQHandler
                B       CSV_IRQHandler

                PUBWEAK SWDT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
SWDT_IRQHandler
                B       SWDT_IRQHandler

                PUBWEAK LVD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
LVD_IRQHandler
                B       LVD_IRQHandler

                PUBWEAK IRQ003SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ003SEL_IRQHandler
                B       IRQ003SEL_IRQHandler

                PUBWEAK IRQ004SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ004SEL_IRQHandler
                B       IRQ004SEL_IRQHandler

                PUBWEAK IRQ005SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ005SEL_IRQHandler
                B       IRQ005SEL_IRQHandler

                PUBWEAK IRQ006SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ006SEL_IRQHandler
                B       IRQ006SEL_IRQHandler

                PUBWEAK IRQ007SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ007SEL_IRQHandler
                B       IRQ007SEL_IRQHandler

                PUBWEAK IRQ008SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ008SEL_IRQHandler
                B       IRQ008SEL_IRQHandler

                PUBWEAK IRQ009SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ009SEL_IRQHandler
                B       IRQ009SEL_IRQHandler

                PUBWEAK IRQ010SEL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
IRQ010SEL_IRQHandler
                B       IRQ010SEL_IRQHandler

                PUBWEAK EXINT0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT0_IRQHandler
                B       EXINT0_IRQHandler

                PUBWEAK EXINT1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT1_IRQHandler
                B       EXINT1_IRQHandler

                PUBWEAK EXINT2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT2_IRQHandler
                B       EXINT2_IRQHandler

                PUBWEAK EXINT3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT3_IRQHandler
                B       EXINT3_IRQHandler

                PUBWEAK EXINT4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT4_IRQHandler
                B       EXINT4_IRQHandler

                PUBWEAK EXINT5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT5_IRQHandler
                B       EXINT5_IRQHandler

                PUBWEAK EXINT6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT6_IRQHandler
                B       EXINT6_IRQHandler

                PUBWEAK EXINT7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
EXINT7_IRQHandler
                B       EXINT7_IRQHandler

                PUBWEAK QPRC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
QPRC0_IRQHandler
                B       QPRC0_IRQHandler

                PUBWEAK QPRC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
QPRC1_IRQHandler
                B       QPRC1_IRQHandler

                PUBWEAK MFT0_WFG_DTIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT0_WFG_DTIF_IRQHandler
                B       MFT0_WFG_DTIF_IRQHandler

                PUBWEAK MFT1_WFG_DTIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT1_WFG_DTIF_IRQHandler
                B       MFT1_WFG_DTIF_IRQHandler

                PUBWEAK MFT2_WFG_DTIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT2_WFG_DTIF_IRQHandler
                B       MFT2_WFG_DTIF_IRQHandler

                PUBWEAK MFT0_FRT_PEAK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT0_FRT_PEAK_IRQHandler
                B       MFT0_FRT_PEAK_IRQHandler

                PUBWEAK MFT0_FRT_ZERO_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT0_FRT_ZERO_IRQHandler
                B       MFT0_FRT_ZERO_IRQHandler

                PUBWEAK MFT0_ICU_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT0_ICU_IRQHandler
                B       MFT0_ICU_IRQHandler

                PUBWEAK MFT0_OCU_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT0_OCU_IRQHandler
                B       MFT0_OCU_IRQHandler

                PUBWEAK MFT1_FRT_PEAK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT1_FRT_PEAK_IRQHandler
                B       MFT1_FRT_PEAK_IRQHandler

                PUBWEAK MFT1_FRT_ZERO_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT1_FRT_ZERO_IRQHandler
                B       MFT1_FRT_ZERO_IRQHandler

                PUBWEAK MFT1_ICU_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT1_ICU_IRQHandler
                B       MFT1_ICU_IRQHandler

                PUBWEAK MFT1_OCU_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT1_OCU_IRQHandler
                B       MFT1_OCU_IRQHandler

                PUBWEAK MFT2_FRT_PEAK_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT2_FRT_PEAK_IRQHandler
                B       MFT2_FRT_PEAK_IRQHandler

                PUBWEAK MFT2_FRT_ZERO_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT2_FRT_ZERO_IRQHandler
                B       MFT2_FRT_ZERO_IRQHandler

                PUBWEAK MFT2_ICU_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT2_ICU_IRQHandler
                B       MFT2_ICU_IRQHandler

                PUBWEAK MFT2_OCU_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFT2_OCU_IRQHandler
                B       MFT2_OCU_IRQHandler

