mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xl/projects/iar/startup_s6e2c2.s
                PUBWEAK SD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
SD_IRQHandler
                B       SD_IRQHandler

                PUBWEAK FLASHIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
FLASHIF_IRQHandler
                B       FLASHIF_IRQHandler

                PUBWEAK MFS12_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS12_RX_IRQHandler
                B       MFS12_RX_IRQHandler

                PUBWEAK MFS12_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS12_TX_IRQHandler
                B       MFS12_TX_IRQHandler

                PUBWEAK MFS13_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS13_RX_IRQHandler
                B       MFS13_RX_IRQHandler

                PUBWEAK MFS13_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS13_TX_IRQHandler
                B       MFS13_TX_IRQHandler

                PUBWEAK MFS14_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS14_RX_IRQHandler
                B       MFS14_RX_IRQHandler

                PUBWEAK MFS14_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS14_TX_IRQHandler
                B       MFS14_TX_IRQHandler

                PUBWEAK MFS15_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS15_RX_IRQHandler
                B       MFS15_RX_IRQHandler

                PUBWEAK MFS15_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
MFS15_TX_IRQHandler
                B       MFS15_TX_IRQHandler




                PUBWEAK Dummy
                SECTION .text:CODE:REORDER:NOROOT(1)
Dummy
                B       Dummy

                END
